[
  {
    "ayah_number": 1,
    "ayah_text": "بسم الله الرحمن الرحيم",
    "parts": [
      {
        "text": "بسم",
        "description": "الباء: حرف جرّ..وق اختلف العلماء حول تسميته.. فهو حرف للاستعانة عند بعض منهم ولدى بعضهم الآخر هو باء السببية..وسمّاه سيبويه باء الالصاق ..ولم يتجوز غيرهم اطلاق لفظ الاستعانة عل الله عزّ وجلّ وقيل : هو حرف جرّ زائد.أمّا [اسم]: فهو اسم مجرور بالباء وعلامة جره الكسرة وهو مضاف واسقطت الف [اسم] اختصاراً من الخط وهي ألف وصل ساقطة في اللّفظ وسبب الاختصار أنّ أصل الكلمة كثر على ألسنة العرب عند الأكل والشرب والقيام والقعود. وفي حالة ذكر اسم من اسماء الله تعلى بعد اضافة [اسم]  إليه لا تحذف الألف وذلك لقلة الاستعمال نحو: باسم الرّبّ ... باسم العزيز وتثبت الألف أيضاً في قولنا : لاسم الله وقعٌ كبير في نفوس المؤمنين .. باسم الرحمن .. اقرأ باسم رّبك الذي خلق. وشبه الجملة (الجار والمجرور) باسم : في معل نصب بفعل مضمر تقديره: أبدأ بسم الله .. أو في محل رفع خبر مبتدأ محذوف بتقدير : بدئي بسم الله"
      },
      {
        "text": "الله",
        "description": "لفظ الجلالة : مضاف إليه مجرور للتعظيم بالاضافة وعلامة الجرّ: الكسرة. والأصل: (الإله) فحذفت الهمزة اختصارًا وأدغمت اللام في اللام فجاء التشديد. وقبل: الأصل : لاهٌ. والألف للوصل. ولفظ الجلالة[الله]: اسم غير مشتقّ من شيء بل هو علم اتّصل به الألف واللام. وذكر سيبويه أنّ أصله: إلاه فدخلت عليه (أل) فبقي الإله ثم نقلت حركة الهمزة الى اللام فسقطت فبقي أللاه فأسكنت اللام الأولى وأدغمت وفخّم تعظيمًا.. ولكنه يرقق (أي تخفّف اللام) مع كسر ما قبله نحو: بالله العظيم.. بفضل الله.. يهدي الله من يشاء... قل الله"
      },
      {
        "text": "الرحمن الرحيم",
        "description": "صفتان (نعتان) للفظ الجلالة [الله] مجروران مثله _ لأن الصفة تتبع الموصوف ـ وعلامة جرّ هما: الكسرة الظاهرة.. وشدّدت الراء فيهما لقلب اللام راءً أو ادغام اللام بالراء.. ولكون الراء فيهما حرفًا شمسيا. وقدّم [الرحمن] وهو الصفة الأولى على [الرحيم] وهو الصفة الثانية لأن الرحمن اسم خاصّ لله عزّ وجلّ و [الرحيم] اسم مشترك يقال: هذا رجل رحيم ولا يقال: هذا رجل رحمن.. فقدّم الخاصّ على العامّ لمنزلته.. وقيل: ان الكلمتين [الرحمن الرحيم]: هما اسمان رفيقان احدهما أرقّ من الآخر.. وقيل: ]الرّحمن] أمدح و [الرحيم] أرقُّ. وبالتالي فهما اسمان يفيدان المدح."
      }
    ]
  }
]