[
  {
    "ayah_number": 1,
    "ayah_text": "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا",
    "parts": [
      {
        "text": "إذا",
        "description": "ظرف لما يستقبل من الزمن مبني على السكون في محل نصب متضمن معنى الشرط خافض لشرطه متعلق بجوابه."
      },
      {
        "text": "زلزلت الأرض",
        "description": "الجملة الفعلية في محل جر بالاضافة. زلزلت: فعل ماض مبني للمجهول مبني على الفتح والتاء تاء التأنيث الساكنة لا محل لها من الاعراب وحركت بالكسر لالتقاء الساكنين. الارض: نائب فاعل مرفوع بالضمة اي اذا اضطربت الارض اضطرابها المقدر عند النفخة الثانية."
      },
      {
        "text": "زلزالها",
        "description": "مفعول مطلق - مصدر - منصوب وعلامة نصبه الفتحة و [ها] ضمير متصل مبني على السكون في محل جر بالاضافة والاضافة تدل على معنى زلزالها الشديد الذي ليس بعده."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا",
    "parts": [
      {
        "text": "واخرجت الارض",
        "description": "الواو عاطفة. اخرجت: فعل ماض مبني على الفتح والتاء تاء التأنيث الساكنة حركت بالكسر لالتقاء الساكنين. الارض: فاعل مرفوع بالضمة والجملة الفعلية في محل جر بالاضافة."
      },
      {
        "text": "أثقالها",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة و [ما] ضمير متصل مبني على السكون في محل جر بالاضافة جمع ثقل وهو متاع البيت اي جعل ما تحمل الأرض في جوفها من الدفائن اثقالاً."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "وَقَالَ الْإِنسَانُ مَا لَهَا",
    "parts": [
      {
        "text": "وقال الإنسان",
        "description": "الواو عاطفة. قال: فعل ماض مبني على الفتح. الإنسان: فاعل مرفوع بالضمة."
      },
      {
        "text": "مالها",
        "description": "الجملة الاسمية في محل نصب مفعول به - مقول القول - ما: اسم استفهام مبني على السكون في محل رفع مبتدأ واللام حرف جر و [ها] ضمير متصل مبني على السكون في محل جر باللام والجار والمجرور متعلق بخبر [ما] اي ما للارض زلزلت هذه الزلزلة الشديدة ولفظت مافي بطنها."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا",
    "parts": [
      {
        "text": "يومئذ",
        "description": "ظرف زمان منصوب على الظرفية بدل من [اذا] و [إذ] اسم مبني على المسكون الظاهر: سكونه وسكون التنوين وهو في محل جر بالاضافة ايضًا والجملة المعوض عنها بالتنوين في محل جر بالاضافة التقدير: يومئذ تزلزل الارض."
      },
      {
        "text": "تحدث اخبارها",
        "description": "الجملة الفعلية جواب شرط غير جازم لا محل لها من الاعراب اي جواب [اذا]. تحدث: فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازًا تقديره هي. اخبار: مفعول به منصوب وعلامة نصبه الفتحة و[ها] ضمير متصل مبني على السكون في محل جر بالاضافة. اي تخبر الارض بما عمل عليها من خير وشر وحذف المفعول الاول للفعل [تحدث] اختصارًا اي تخبر الخلق اخبارها."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا",
    "parts": [
      {
        "text": "بأن ربك",
        "description": "الباء حرف جر. أن: حرف نصب وتوكيد مشبه بالفعل. ربك: اسم [أن] منصوب بالفتحة والكاف ضمير متصل  - ضمير المخاطب - مبني على الفتح في محل جر بالاضافة والجملة الفعلية بعده في محل رفع خبر [أن] و[أن] وما بعدها - اي ومعموليها - بتأويل مصدر في محل جر بالباء والجمار والمجرور متعلق بتحدث. اي تحدث اخبارها بسبب ايحاء ربك لها وامره اياها بالتحديث اوان يكون المعنى يومئذ تحدث بتحديث ان ربك أوحى لها أخبارها على أن تحديثها بأن ربك اوحى لها تحديث بأخبارها ويجوز ان يكون [بأن ربك]  بدلًا من اخبارها اي يومئذ تحدث بأخبارها بأن ربك اوحى لها لاننا نقول حدثه كذا وحدثه بكذا."
      },
      {
        "text": "أوحى لها",
        "description": "فعل ماض مبني على الفتح المقدر على الالف للتعذر والفاعل ضمير مستتر فيه جوازًا تقديره هو واللام حرف جر و[ها] ضمير متصل مبني على السكون في محل جر باللام والجار والمجرور متعلق بأوحى و [ها] بمعنى (اليها) لان اللام لام العاقبة اي عاقبت هنا الى."
      }
    ]
  },
  {
    "ayah_number": 6,
    "ayah_text": "يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِّيُرَوْا أَعْمَالَهُمْ",
    "parts": [
      {
        "text": "يومئذ يصدر الناس",
        "description": "سبق اعرابها. يصدر: فعل مضارع مرفوع بالضمة. الناس: فاعل مرفوع بالضمة."
      },
      {
        "text": "أشتاتًا",
        "description": "حال منصوب بالفتحة اي يومئذ يصدر الناس عن مخارجهم من القبور الى الموقف متفرقين بيض الوجوه آمنين وسود الوجوه فزعين او يتفرق بهم طريقا الجنة والنار."
      },
      {
        "text": "ليروا",
        "description": "اللام لام التعليل او لام (لاكي). يروا: فعل مضارع مبني للمجهول منصوب بأن مضمرة بعد اللام وعلامة نصبه حذف النون والواو ضمير متصل في محل رفع نائب فاعل والالف فارقة. وجملة [يروا] صلة (أن) المضمرة لامحل لها من الاعراب. و(أن) المضمرة وما بعدها بتأويل مصدر في محل جر باللام والجار والمجرور متعلق بيصدر."
      },
      {
        "text": "أعمالهم",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة و[هم] ضمير الغائبين في محل جر بالاضافة اي جزاء اعمالهم فحذف المضاف المنصوب وحل المضاف اليه محله."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ",
    "parts": [
      {
        "text": "فمن",
        "description": "الفاء استئنافية. من: اسم شرط جازم مبني على السكون في محل رفع مبتدأ والجملة الشرطية من فعل الشرط وجوابه في محل رفع خبر [من]."
      },
      {
        "text": "يعمل",
        "description": "فعل مضارع فعل الشرط مجزوم بمن وعلامة جزمه سكون آخره والفاعل ضمير مستتر فيه جوازًا تقديره هو."
      },
      {
        "text": "مثقال ذرة",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة. ذرة: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة."
      },
      {
        "text": "خيرًا يره",
        "description": "تمييز منصوب بالفتحة اي من خير ويجوز ان يكون بدلاً من [مثقال]. يره: فعل مضارع جواب الشرط مجزوم بمن وعلامة جزمه حذف آخره _ حرف العلة - الالف. والفاعل ضمير مستتر فيه جوازًا تقديره هو والهاء ضمير متصل مبني على الضم في محل نصب مفعول به يعود على [مثقال] و(الذرة) ما يرى في شعاع الشمس من الهباء و [مثقال] زنة."
      }
    ]
  },
  {
    "ayah_number": 8,
    "ayah_text": "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ",
    "parts": [
      {
        "text": "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ",
        "description": "معطوفة بالواو على الآية الكريمة السابقة وتعرب إعرابها."
      }
    ]
  }
]