[
  {
    "ayah_number": 1,
    "ayah_text": "وَالْعَادِيَاتِ ضَبْحًا",
    "parts": [
      {
        "text": "والعاديات",
        "description": "الواو حرف جر وهو واو القسم. العاديات: اسم مجرور بواو القسم وعلامة جره الكسرة والجار والمجرور متعلق بفعل القسم المحذوف. التقدير: ورب العاديات اي أقسم بخيل الغزاة وهي تعدو فتضبح وهو صوتها عند الجري."
      },
      {
        "text": "ضبحًا",
        "description": "مفعول مطلق - مصدر - منصوب بفعل مضمر تقدير (يضبحن) او منصوب بالعاديات بمعنى والضابحات لان الضبح يكون مع العدو وعلامة نصبه الفتحة او يكون مصدرًا في موضع الحال اي ضابحات. والضبح: صوت انفاسها اذا عدون."
      }
    ]
  },
  {
    "ayah_number": 10,
    "ayah_text": "وَحُصِّلَ مَا فِي الصُّدُورِ",
    "parts": []
  },
  {
    "ayah_number": 11,
    "ayah_text": "إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌ",
    "parts": [
      {
        "text": "ان ربهم",
        "description": "حرف نصب وتوكيد مشبه بالفعل وهي واقعة في جواب (اذا) و [إن] وما في حيزها من اسمها وخبرها جواب شرط غير جازم لا محل لها من الاعراب. رب: اسم [إن] منصوب وعلامة نصبه الفتحة و[هم] ضمير الغائبين في محل جر بالاضافة."
      },
      {
        "text": "بهم",
        "description": "الباء حرف جر و[هم] ضمير الغائبين في محل جر بالباء والجار والمجرور متعلق بخبر [إن]"
      },
      {
        "text": "يومئذ",
        "description": "ظرف زمان منصوب على الظرفية وهو مضاف و [اذ] اسم مبني على السكون الظاهر على آخره حرك بالكسر تخلصًا من التقاء الساكنين: سكونه وسكون التنوين وهو في محل جر بالاضافة وهو مضاف أيضًا. والجملة المحذوفة المعوض عنها بالتنوين في محل جر بالاضافة التقدير يومئذ يبعثر ما فى القبور ويحصل ما في الصدور."
      },
      {
        "text": "لخبير",
        "description": "اللام لام التوكيد - المزحلقة -. خبير: خبر [إن] مرفوع بالضمة."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "فَالْمُورِيَاتِ قَدْحًا",
    "parts": [
      {
        "text": "معطوفة بالفاء على الآية الكريمة السابقة. قدحًا",
        "description": "مفعول مطلق - مصدر - منصوب وعلامة نصبه الفتحة او تعرب اعراب [ضبحًا] التي توري النار بسنابكها اي تقدح بمعنى فأورين او تكون بمعنى (قادحات) اي صاكات الحجارة."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "فَالْمُغِيرَاتِ صُبْحًا",
    "parts": []
  },
  {
    "ayah_number": 4,
    "ayah_text": "فَأَثَرْنَ بِهِ نَقْعًا",
    "parts": [
      {
        "text": "فأثرن",
        "description": "الفاء عاطفة. أثرن: فعل ماض مبني على السكون لاتصاله بنون الاناث والنون ضمير متصل مبني على الفتح في محل رفع فاعل وهو ضمير الخيل وعطف الفعل على الاسم الذي هو العاديات وما بعده لانها اسماء فاعلين تعطى معنى الفعل وفي هذا العطف حكمة تصوير هذه الافعال في النفس لما بين الفعل والاسم من التخالف وهو ابلغ من التصوير بالاسماء المتناسقة وكذلك التصوير بالمضارع بعد الماضي و[أثرن]  بمعنى (هيجن)."
      },
      {
        "text": "به نقعًا",
        "description": "جار ومجرور متعلق بأثرن اي بذلك الوقت او يكون الضمير في [به] كناية عن الوادي وان لم يتقدم ذكر لانه معروف من السياق. نقعًا: مفعول به منصوب وعلامة نصبه الفتحة اي غبارًا ويجوز ان يراد به الصياح والجلبة."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "فَوَسَطْنَ بِهِ جَمْعً",
    "parts": [
      {
        "text": "معطوفة بالواو على الآية الكريمة السابقة ونعرب اعرابها اي فوسطن ملتبسات به مع جموع الاعداء. ووسطن اي توسطن. جمعًا",
        "description": "تعرب اعراب [صبحًا] او تكون فوسطن النفع الجمع."
      }
    ]
  },
  {
    "ayah_number": 6,
    "ayah_text": "إِنَّ الْإِنسَانَ لِرَبِّهِ لَكَنُودٌ",
    "parts": [
      {
        "text": "إن الإنسان",
        "description": "حرف نصب وتوكيد مشبه بالفعل. الانسان: اسم [إن] منصوب وعلامة نصبه الفتحة."
      },
      {
        "text": "لربه لكنود",
        "description": "جار ومجرور متعلق بكنود والهاء ضمير متصل في محل جر بالاضافة واللام لام التوكيد - المزحلفة -. كنود: خبر [إن] مرفوع بالضمة اي انه لنعمة ربه خصوصًا لشديد الكفران ومن معانيها الكفور... العاصي و [إن] واقعة في جواب القسم."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "وَإِنَّهُ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ",
    "parts": [
      {
        "text": "معطوفة بالواو على الآية الكريمة السابقة وتعرب اعرابها والهاء ضمير متصل مبني على الضم في محل نصب اسم [إن] على",
        "description": "حرف جر. ذا: اسم اشارة مبني على السكون في محل جر بعلى واللام للبعد والكاف للخطاب اي وان الانسان على كنوده لشهيداي يشهد على نفسه وقيل وان الله على كنوده لشاهد على سبيل الوعيد."
      }
    ]
  },
  {
    "ayah_number": 8,
    "ayah_text": "وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ",
    "parts": []
  },
  {
    "ayah_number": 9,
    "ayah_text": "أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ",
    "parts": [
      {
        "text": "أفلا يعلم",
        "description": "الالف الف انكار وتعجيب بلفظ استفهام والفاء تزيينية. لا: نافية لا عمل لها. يعلم: فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازًا تقديره هو والجملة الشرطية بعده مع جوابها سدت مسد مفعولي [يعلم]."
      },
      {
        "text": "إذا",
        "description": "ظرف لما يستقبل من الزمن مبني على السكون في محل نصب بجوابه متضمن معنى الشرط."
      },
      {
        "text": "بعثر ما",
        "description": "الجملة الفعلية في محل جر بالاضافة. بعثر: فعل ماض مبني للمجهول مبني على الفتح. ما: اسم موصول مبني على السكون في محل رفع نائب فاعل."
      },
      {
        "text": "في القبور",
        "description": "جار ومجرور متعلق بصلة الموصول المحذوفة. التقدير: ما استقر في القبور."
      }
    ]
  }
]