[
  {
    "ayah_number": 1,
    "ayah_text": "أَلْهَاكُمُ التَّكَاثُرُ",
    "parts": [
      {
        "text": "ألهاكم التكاثر",
        "description": "فعل ماض مبني على  الفتح المقدر على الالف للتعذر والكاف ضمير متصل - ضمير المخاطبين  - مبني على الضم في محل نصب مفعول به مقدم والميم علامة جمع الذكور. التكاثر: فاعل مرفوع بالضمة اي شغلكم التباري - التباهي - في الكثرة او بالاموال والاولاد."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "حَتَّىٰ زُرْتُمُ الْمَقَابِرَ",
    "parts": [
      {
        "text": "حتى زرتم",
        "description": "حرف غاية وابتداء. زرتم: فعل ماض مبني على السكون لاتصاله بضمير الرفع المتحرك والتاء ضمير متصل مبني على الضم في محل رفع فاعل - وهو ضمير المخاطبين - والميم علامة اجمع."
      },
      {
        "text": "المقابر",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة. وزيارة المقابر عبارة عن الموت اي صرتم الى المقابر فتكاثرتم بالاموات وفي القول الكريم تهكم بهم."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "كَلَّا سَوْفَ تَعْلَمُونَ",
    "parts": [
      {
        "text": "كلا سوف",
        "description": "حرف ردع وتنبيه على انه لا ينبغي ان لا يهتم الناظر لنفسه بدينه. وقيل حرف ردع وزجر لا عمل له و يجوز ان يكون بمعنى (حقًا) وليس ردًا. سوف: حرف تسويف - استقبال - فيه وعيد وتهديد وانذار ليخافوا فينتبهوا عن غفلتهم."
      },
      {
        "text": "تعلمون",
        "description": "فعل مضارع مرفوع بثبوت النون والواو ضمير متصل في محل رفع فاعل وحذف المفعول لانه مفهوم من السياق اي سوف تعلمون الخطأ فيما انتم عليه."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ",
    "parts": []
  },
  {
    "ayah_number": 5,
    "ayah_text": "كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ",
    "parts": [
      {
        "text": "كلا لو تعلمون",
        "description": "بدل من الاولى. لو: حرف شرط غير جازم وجواب الشرط محذوف. التقدير: لفعلتم مالا يوصف. تعلمون: سبق اعرابها وقيل [لو] حرف تمن."
      },
      {
        "text": "علم اليقين",
        "description": "مفعول مطلق - مصدر - لبيان نوع الفعل منصوب بالفتحة وهو مضاف. اليقين: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة اي تعلمون ذلك علمًا يقينًا حقًا. وقال الاخفش: الاصل: وعلم اليقين وهو قسم فحذفت واو القسم فنصب [علم]."
      }
    ]
  },
  {
    "ayah_number": 6,
    "ayah_text": "لَتَرَوُنَّ الْجَحِيمَ",
    "parts": [
      {
        "text": "لترون الجحيم",
        "description": "اللام واقعة في جواب قسم محذوف والجملة جواب قسم محذوف لا محل لها من الاعراب. التقدير: و والله لترون الجحيم. هذا اذا لم يكن (العلم) في (علم اليقين) قسمًا وفي حالة جعله قسمًا تكون اللام جوابه او موصلة له. الجحيم: مفعول به منصوب وعلامة نصبه الفتحة. اما [ترون]  فهي فعل مضارع مبني على حذف النون لانه من الافعال الخمسة وسبب بنائه على حذف النون اتصاله بنون التوكيد الثقيلة وواو الجماعة المحذوفة لالتقائها ساكنة مع نون التوكيد الثقيلة في محل رفع فاعل. ونو التوكيد الثقيلة لا محل لها من الاعراب. والقسم هنا لتوكيد الوعيد وان ما اوعدوا به لاشك فيه."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ",
    "parts": []
  },
  {
    "ayah_number": 8,
    "ayah_text": "ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ",
    "parts": [
      {
        "text": "ثم لتسألن",
        "description": "حرف عطف. لتسألن: تعرب اعراب [لترون] في الآية الكريمة الخامسة. الا ان الفعل هنا مبني للمجهول وواو الجماعة المحذوفة في محل رفع نائب فاعل."
      },
      {
        "text": "يومئذ عن النعيم",
        "description": "سبق اعرابها في الآية الكريمة الحادية عشرة من سورة (العاديات). عن النعيم: جار ومجرور متعلق بتسألن وكسرت نون (عن) لالتقاء الساكنين."
      }
    ]
  }
]