[
  {
    "ayah_number": 1,
    "ayah_text": "وَالْعَصْرِ",
    "parts": [
      {
        "text": "والعصر",
        "description": "الواو واو القسم حرف جر. العصر: اسم مجرور بواو القسم وعلامة جره الكسرة والجار والمجرور متعلق بفعل القسم المحذوف. أقسم بصلاة العصر لفضلها."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "إِنَّ الْإِنسَانَ لَفِي خُسْرٍ",
    "parts": [
      {
        "text": "ان الانسان",
        "description": "جواب القسم وهو حرف نصب وتوكيد مشبه بالفعل ولهذا كسرت همزتها لانها واقعة في جواب القسم ووجود اللام في خبرها. الانسان: اسمها منصوب وعلامة نصبه الفتحة."
      },
      {
        "text": "لفي خسر",
        "description": "اللام لام التوكيد - المزحلقة -. في خسر: جار ومجرور متعلق بخبر [إن] اي لفي خسران."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ",
    "parts": [
      {
        "text": "إلا الذين",
        "description": "اداة استثناء. الذين: اسم موصول مبني على الفتح في محل نصب مستثنى بإلا وهو استثناء متصل لانه مستثنى من الانسان  لانه بمعنى (جمع) لانه اسم جنس في معنى (الأناسي) و (الناس) والجملة الفعلية بعده صلته لا محل لها من الاعراب."
      },
      {
        "text": "آمنوا",
        "description": "فعل ماض مبني على الضم لاتصاله بواو الجماعة والواو ضمير متصل في محل رفع فاعل والالف فارقة."
      },
      {
        "text": "وعملوا الصالحات",
        "description": "معطوفة بالواو على [آمنوا] وتعرب اعرابها الصالحات: مفعول به منصوب وعلامة نصبه الكسرة بدلاً من الفتحة لانه من جمع المؤنث السالم."
      },
      {
        "text": "وتواصوا بالحق",
        "description": "تعرب اعراب [وعملوا] وعلامة بناء الفعل الضمة او الفتحة المقدرة على الالف المحذوفة لالتقاء الساكنين وبقيت الفتحة دالة عليها. بالحق: جار ومجرور متعلق بتواصوا اي يوصي بعضهم بعضًا بالخير كله من توحيد الله وطاعته واتباع كتبه ورسله."
      },
      {
        "text": "وتواصوا بالصبر",
        "description": "معطوفة بالواو على [تواصوا بالحق] وتعرب اعرابها اي يوصي بعضهم بعضًا بالصبر على الطاعات وعن المعاصي وعلى ما يبلو الله به عباده."
      }
    ]
  }
]