[
  {
    "ayah_number": 1,
    "ayah_text": "وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ",
    "parts": [
      {
        "text": "ويل",
        "description": "مبتدأ مرفوع بالضمة وهو نكرة وجاز الابتداء به لانه قريب من المعرفة وقيل هو في الاصل مصدر لا فعل له معناه تحسر وقيل هو واد في جهنم وقيل اسم معنى كالهلاك ويرفع رفع المصادر لافادة معنى الثبات وقيل جاء نكرة لانه متضمن معنى الفعل الدعاء. لان معنى (الويل) الهلاك والعذاب."
      },
      {
        "text": "لكل همزة لمزة",
        "description": "جار ومجرور متملق بخبر [ويل] المحذوف. همزة: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة. لمزة: بدل منه اي من [همزة] مجرورة مثلها وعلامة جرها الكسرة والهمزة الذي يهمز الناس اي يغتابهم. ولمزة الذي يطعن الناس والهاء دخلت للمبالغة في الذم فالهامز المغتاب واللامز العياب."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ",
    "parts": [
      {
        "text": "الذي",
        "description": "اسم موصول مبني على السكون في محل رفع خبر مبتدأ محذوف تقديره هو والجملة الاسمية [هو الذي] في محل جر صفة - نعت - لهمزة لان النكرة لا توصف بالمعرفة وقيل يجوز ان يكون في محل جر صفة لكل همزة لمزة اي يكون نعتًا وهو معرفة لمنعوت نكرة او يكون بدلاً منه في محل جر اي بدلاً من كل همزة او يكون في محل نصب على الذم اي اعني الذي.... والجملة الفعلية بعده صلته لا محل لها."
      },
      {
        "text": "جمع مالاً",
        "description": "فعل ماض مبني على الفتح والفاعل ضمير مستتر فيه جوازًا تقديره هو. مالاً: مفعول به منصوب بالفتحة."
      },
      {
        "text": "وعدده",
        "description": "معطوفة بالواو على [جمع] وتعرب اعرابها والهاء ضمير متصل في محل نصب مفعول به اي جعله عدة لحوادث الدهر او عدة مرة بعد مرة."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ",
    "parts": [
      {
        "text": "يحسب",
        "description": "فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازًا تقديره هو."
      },
      {
        "text": "أن ماله",
        "description": "حرف نصب وتوكيد مشبه بالفعل. ماله: اسم [أن] منصوب بالفتحة والهاء ضمير متصل مبني على الضم في محل جر بالاضافة والجملة الفعلية [اخلده]  في محل رفع خبر [أن]."
      },
      {
        "text": "أخلده",
        "description": "فعل ماض مبني على الفتح والفاعل ضمير مستتر فيه جوازًا تقديره هو والهاء ضمير متصل مبني على الضم في محل نصب مفعول به و [أن] وما في حيزها اي معموليها من اسمها وخبرها في محل نصب سدت مسد مفعولي [يحسب] اي ان المال تركه خالدًا في الدنيا لا يموت. والجملة الفعلية [يحسب] وما بعدها لا محل ها من الاعراب لانها بدل من صلة [الذي]."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "كَلَّا ۖ لَيُنبَذَنَّ فِي الْحُطَمَةِ",
    "parts": [
      {
        "text": "كلا",
        "description": "حرف ردع وزجر لا عمل له. اي ردع له على حسبانه وردًا لقالته."
      },
      {
        "text": "لينبذن",
        "description": "اللام لام التوكيد. ينبذن: فعل مضارع مبني للمجهول مبني على الفتح لاتصاله بنون التوكيد الثقيلة ونائب الفاعل ضمي مستتر فيه جوازًا تقديره هو ونون التوكيد الثقيلة لا عمل لها."
      },
      {
        "text": "فى الحطمة",
        "description": "جار ومجرور متعلق بينبذن اي ليرمين او يتركن في جهنم التي من شأنها ان تحطم كل ما يلقى فيها."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "وَمَا أَدْرَاكَ مَا الْحُطَمَةُ",
    "parts": []
  },
  {
    "ayah_number": 6,
    "ayah_text": "نَارُ اللَّهِ الْمُوقَدَةُ",
    "parts": [
      {
        "text": "نار الله الموقدة",
        "description": "بدل من [الحطمة] او خبر مبتدأ محذوف تقديره هي. الله لفظ الجلالة: مضاف اليه مجرور للتعظيم بالاضافة وعلامة الجر الكسرة. الموقدة: صفة - نعت - لنار الله مرفوعة مثلها بالضمة."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ",
    "parts": [
      {
        "text": "التي",
        "description": "اسم موصول مبني على السكون في محل رفع صفة ثانية للنار والجملة الفعلية بعده صلته لا محل لها."
      },
      {
        "text": "تطلع على الافئدة",
        "description": "فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازا تقديره هي. على الافئدة: جار ومجرور متعلق بتطلع اي تعلو القلوب وتغليها وتشتمل عليها. والافئدة جمع (فؤاد) وهي اوساط القلوب."
      }
    ]
  },
  {
    "ayah_number": 8,
    "ayah_text": "إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ",
    "parts": [
      {
        "text": "انها عليهم مؤصدة",
        "description": "حرف نصب وتوكيد مشبه بالفعل و [ها] ضمير متصل مبني على السكون في محل نصب اسم [إن] على: حرف جر و[هم] ضمير الغائبين في محل جر بعلى والجار والمجرور متعلق بخبر [إن] مؤصدة: خبر [إن] مرفوع بالضمة اي ان النار عليهم مطبقة اي مقفلة."
      }
    ]
  },
  {
    "ayah_number": 9,
    "ayah_text": "فِي عَمَدٍ مُّمَدَّدَةٍ",
    "parts": [
      {
        "text": "فى عمد ممددة",
        "description": "جار ومجرور متعلق بمؤصدة بمعنى موثقين بعمد وهي جمع عامود. ممددة: صفة - نعت - لعمد مجرورة مثلها بالكسرة اي ممتدة."
      }
    ]
  }
]