[
  {
    "ayah_number": 1,
    "ayah_text": "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ",
    "parts": [
      {
        "text": "ألم تر",
        "description": "الالف: ألف تقرير في لفظ استفهام وقيل الف توبيخ بلفظ استفهام والاستفهام تقرير للمخاطب وهو الرسول الكريم محمد ﷺ وفيه تعريض بالمشركبن على سبيل التوبيخ. لم: حرف نفي وجزم وقلب. تر: فعل مضارع مجزوم بلم وعلامة جزمه حذف آخره - الالف - حرف العلة وبقيت الفتحة دالة عليه والفاعل ضمير مستتر فيه وجوبًا تقديره انت والجملة الاستفهامية بعده في محل نصب مفعول به للفعل [ترى]."
      },
      {
        "text": "كيف فعل ربك",
        "description": "اسم استفهام مبني على الفتح في محل نصب حال والعامل فيه (فعل) وهو توبيخ بلفظ استفهام واصل آخره - الفاء - السكون فنحت لالتقاء الساكنين فعل ماض مبني على الفتح. ربك: فاعل مرفوع بالضمة والكاف ضمير متصل - ضمير المخاطب - في محل جر بالاضافة."
      },
      {
        "text": "باصحاب الفيل",
        "description": "جار ومجرور متعلق بفعل. الفيل: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ",
    "parts": [
      {
        "text": "ألم يجعل",
        "description": "اعربت. يجعل: فعل مضارع مجزوم بلم وعلامة جزمه سكون آخره والفاعل ضمير مستتر فيه جوازًا تقديره هو."
      },
      {
        "text": "كيدهم في تضليل",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة و[هم] ضمير الغائبين في محل جر بالاضافة. في تضليل: جار ومجرور متعلق بيجعل وهوفي مقام المفعول الثاني ليجعل لان المعنى ألم يصير كيدهم في تضييع."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ",
    "parts": [
      {
        "text": "وأرسل عليهم",
        "description": "معطوفة بالواو على [يجعل] وتعرب اعرابها لان [ألم يجعل] بمعنى  (جعل). على: حرف جر و[هم] ضمير الغائبين في محل جر بعلى والجار والمجرور متعلق بأرسل."
      },
      {
        "text": "طيرًا ابابيل",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة. أبابيل: صفة - نعت - لطيرًا منصوبة مثلها بالفتحة ولم تنون لانها ممنوعة من الصرف على وزن مفاعيل اي جماعات."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ",
    "parts": [
      {
        "text": "ترميهم",
        "description": "الجملة الفعلية في محل نصب صفة ثانية لطيرًا وهي فعل مضارع مرفوع بالضمة المقدرة على الياء للثقل والفاعل ضمير مستتر فيه جوازًا تقديره هي يعود على [طيرًا] وهو اسم جمع مذكر انث على المعنى و [هم] ضبمير الغائبين في محل نصب مفعول به."
      },
      {
        "text": "بحجارة من سجيل",
        "description": "جار ومجرور متعلق بترميهم. من: حرف جر بياني. سجيل: اسم مجرور بمن وعلامة جره الكسرة والجار والمجرور متعلق بصفة محذوفة لحجارة اي من طين مطبوخ كما يطبخ الآجر."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ",
    "parts": [
      {
        "text": "فجعلهم",
        "description": "معطوفة بالفاء على [ارسل] وتعرب اعرابها و [هم] ضمير الغائبين في محل نصب مفعول به اول."
      },
      {
        "text": "كعصف مأكول",
        "description": "الكاف اسم بمعنى (مثل) مبني على الفتح في محل نصب مفعول به ثان لان [جعلهم] بمعنى (صيرهم) وهو مضاف. عصف: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة. مأكول: صفة - نعت - لعصف مجرورة مثلها وعلامة جرها الكسرة اي كورق الشجر او الزرع اذا اكل اي وقع فيه الأكال وفيل هو دقاق التبن المبلول."
      }
    ]
  }
]