[
  {
    "ayah_number": 3,
    "ayah_text": "فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ",
    "parts": [
      {
        "text": "فليعبدوا",
        "description": "الفاء واقعة في جواب شرط مقدر على المعنى اي إن نعم الله عليهم لا تحصى فإن لم يعبدوه لسائر نعمه فليعبدوه لهذه النعمة الظاهرة واللام لام الامر. يعبدوا: فعل مضارع مجزوم باللام وعلامة جزمه حذف النون والواو ضمير متصل في محل رفع فاعل والالف فارقة."
      },
      {
        "text": "رب هذا",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة. هذا: اسم اشارة مبني على السكون في محل جر بالاضافة."
      },
      {
        "text": "البيت",
        "description": "صفة - نعت - لاسم الاشارة او بدل منه مجرور وعلامة جره الكسرة."
      }
    ]
  },
  {
    "ayah_number": 1,
    "ayah_text": "لِإِيلَافِ قُرَيْشٍ",
    "parts": [
      {
        "text": "لإيلاف قريش",
        "description": "جار ومجرور متعلق بقوله [فليعبدوا] امرهم ان يعبدوه لأجل إيلافهم الرحلتين وقيل: المعنى عجبوا لايلاف قريش. والإيلاف مصدر (آلف)  بمعنى (ألف) وقيل اللام لام السبب بمعنى (لأجل)اوهي للتعليل او يكون التقدير (أي اعجبوا لإيلاف فريش) اي تكون اللام للتعجب. قريس: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ",
    "parts": [
      {
        "text": "إيلافهم",
        "description": "بدل من [إيلاف] الاولى مجرورة مثلها وعلامة جرها الكسرة و [هم] ضمير الغائبين في محل جر بالاضافة."
      },
      {
        "text": "رحلة الشتاء والصيف",
        "description": "مفعول به للمصدر منصوب وعلامة نصبه الفتحة اي ألفوا رحلة. الشتاء: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة. والصيف: معطوفة بالواو على [الشتاء] وتعرب اعرابها."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ",
    "parts": [
      {
        "text": "الذي",
        "description": "اسم موصول مبني على السكون في محل نصب صفة - نعت - لرب والجملة الفعلية بعده صلته لا محل ها."
      },
      {
        "text": "أطعمهم من جوع",
        "description": "فعل ماض مبني على الفتح والفاعل ضمير مستتر فيه جوازًا تقديره هو و [هم] ضمير الغائبين في محل نصب مفعول به. من جوع: جار ومجرور متعلق بأطعمهم اي اطعمهم بالرحلتين عن جوع شديد."
      },
      {
        "text": "وآمنهم من خوف",
        "description": "معطوفة بالواو على [اطعمهم من جوع] وتعرب اعرابها. وقيل [من] بمعنى (عن) او بمعنى (البدل) اي بدل جوع وجاء تنكير [جوع] و [خوف]  لشدتهما."
      }
    ]
  }
]