[
  {
    "ayah_number": 1,
    "ayah_text": "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ",
    "parts": [
      {
        "text": "أرأيت",
        "description": "الألف: ألف تقرير وتنبيه في لفظ استفهام. رأيت: فعل ماضٍ مبني على السكون لاتصاله بضمير الرفع المتحرك والتاء ضمير متصل - ضمير المخاطب - مبني على الفتح في محل رفع فاعل."
      },
      {
        "text": "الذي يكذب",
        "description": "اسم موصول مبني على السكون في معل نصب مفعول به. يكذب: فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازًا تقديره هو وجملة [يكذب] صلة الموصول لا محل لها."
      },
      {
        "text": "بالدين",
        "description": "جار ومجرور متعلق بيكذب اي هل عرفت الذي يكذب بالجزاء من هو؟"
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ",
    "parts": [
      {
        "text": "فذلك",
        "description": "الفاء واقعة في جواب شرط مقدر على المعنى اي ان لم تعرف الذي يكذب بالجزاء فذلك.... او تكون [فذلك] معطوفة على الذي يكذب ويكون جواب [أرأيت} محذوفًا لدلالة ما بعده عليه اي اخبرني وما تقول فيمن يكذب بالجزاء أنعم ما يصنع. ذا: اسم اشارة مبني على السكون في محل رفع مبتدأ واللام للبعد والكاف للخطاب."
      },
      {
        "text": "الذي",
        "description": "اسم موصول مبني عل السكون في محل رفع خبر مبتدا محذوف تقديره هو والجملة الاسمية [هو الذي] في محل رفع خبر [ذلك] والجملة الفعلية بعده صلته لامحل لها من الاعراب."
      },
      {
        "text": "يدع اليتيم",
        "description": "فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه جوازًا تقديره هو. اليتيم: مفعول به منصوب وعلامة نصبه الفتحة اي يدفعه دفعًا عنيفًا بجفوة."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ",
    "parts": [
      {
        "text": "ولا يحض",
        "description": "معطوفة بالواو على [يدع] وتعرب اعرابها. و [لا] نافية للتأكيد اي ولا يحث."
      },
      {
        "text": "على طعام المسكين",
        "description": "جار ومجرور متعلق بلا يجض. المسكين: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "فَوَيْلٌ لِّلْمُصَلِّينَ",
    "parts": [
      {
        "text": "فويل للمصلين",
        "description": "الفاء استئنافية. ويل: مبتدً مرفوع بالضمة وقد سبق شرحه. للمصلين: جار ومجرور متعلق بخبر [ويل] المحذوف وعلامة جر الاسم الياء لانه جمع مذكر سالم والنون عوض من التنوين والحركة في المفرد. ويجوز ان تكون الفاء واقعة في جواب شرط مقدر على المعنى. اي فاذا كان الامر كذلك فويل للمصلين على معنى فويل لهم فوضعت صفتهم موضع ضميرهم الذي يعود على ضمير الذي يكذب وهو مفرد الا ان معناه الجمع لان المراد به الجنس."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ",
    "parts": [
      {
        "text": "الذين",
        "description": "اسم موصول مبني على الفتح في محل جر صفة - نعت - للمصلين. والجملة الاسمية بعده صلته لا محل لها."
      },
      {
        "text": "هم عن صلاتهم",
        "description": "ضمير رفع منفصل في محل رفع مبتدا. عن: حرف جر. صلاة: اسم مجرور بعن وعلامة جره الكسرة و [هم] ضمير الغائبين في محل جر بعن والجار والمجرور متعلق بخبر [هم]."
      },
      {
        "text": "ساهون",
        "description": "خبر [هم] وعلامة رفعه الواو لانه جمع مذكر سالم والنون عوض من تنوين المفرد والاصل [ساهيون] فحذفت الياء لسكونها وسكون الواو بعد حذف الضمة التي كانت على الياء للثقل اي غافلون غير ملتفتين اليها."
      }
    ]
  },
  {
    "ayah_number": 6,
    "ayah_text": "الَّذِينَ هُمْ يُرَاءُونَ",
    "parts": [
      {
        "text": "الذين",
        "description": "اسم موصول مبني على الفتح في محل جر لانه بدل من [الذين] الواردة في الآية السابقة."
      },
      {
        "text": "هم يراءون",
        "description": "الجملة الاسمية صلة الموصول لا محل لها من الاعراب. هم: ضمير رفع منفصل في محل رفع مبتدأ. يراءون: فعل مضارع مرفوع بثبوت النون والواو ضمير متصل في محل رفع فاعل والجملة الفعلية [يراءون]  في محل رفع خبر [هم]."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "وَيَمْنَعُونَ الْمَاعُونَ",
    "parts": [
      {
        "text": "معطوفة بالواو على [يراءون] وتعرب اعرابها. الماعون",
        "description": "مفعول به منصوب وعلامة نصبه الفتحة اي الزكاة."
      }
    ]
  }
]