[
  {
    "ayah_number": 1,
    "ayah_text": "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ",
    "parts": [
      {
        "text": "إنا",
        "description": "حرف نصب وتوكيد مشبه بالفعل و [نا] ضمير متصل مبني على السكون في محل نصب اسم [ان]."
      },
      {
        "text": "أعطيناك الكوثر",
        "description": "الجملة الفعلية: في محل رفع خبر [ان] أعطى: فعل ماضٍ مبني على السكون لاتصاله بنا. و [نا] ضمير متصل مبني على السكون في محل رفع فاعل. والكاف ضمير متصل - ضمير المخاطب - مبني على الفتح في محل نصب مفعول به أول. الكوثر: مفعول به ثانٍ منصوب وعلامة نصبه الفتحة. أي نهرًا في الجنة. وهو بصيغة (فوعل) من الكثرة وهو المفرط الكثرة. أو الخبر الكثير وقيل: النبوة أو القرآن."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "فَصَلِّ لِرَبِّكَ وَانْحَرْ",
    "parts": [
      {
        "text": "فصل",
        "description": "الفاء استئنافية. صل: فعل أمر مبني على حذف آخره - الياء - وهو حرف العلة. والفاعل ضمير مستتر فيه وجوبًا تقديره أنت. ويجوز أن تكون الفاء عاطفة للتسبيب."
      },
      {
        "text": "لربك وانحر",
        "description": "جار ومجرور متعلق بصل والكاف ضمير متصل - ضمي المخاطب - مبني على الفتح في محل جر بالاضافة. وانحر:  معطوفة بالواو على [صل] وتعرب اعرابها. وعلامة بناء الفعل السكون. وفي معنى هذه الكلمة اختلاف بين المفسرين ولها عدة معان جاء في كشاف الزمخشري: النحر: نحر البدن. وعن عطيه هي صلاة الفجر بجمع والنحر بمن، وقيل صلاة العيد والتضحية. وقيل: هي جنس الصلاة والنحر وضع اليمين على الشمال. أو وانحر لوجهه تعالى وباسمه سبحانه اذا نحرت مخالفًا للذين يعبدون غير الله في النحر للأوثان."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ",
    "parts": [
      {
        "text": "إن شانئك",
        "description": "حرف نصب وتوكيد مشبه بالفعل. شانئك: اسم [ان] منصوب وعلامة نصبه الفتحة والكاف ضمي متصل - ضمر المخاطب - مبني على الفتح في محل جر بالاضافة أي ان مبغضك."
      },
      {
        "text": "هو الأبتر",
        "description": "الجملة الاسمية: في محل رفع خبر [ان] هو: ضمير رفع منفصل مبني على الفتح في محل رفع مبتدأ. الأبتر: خبر [هو] مرفوع بالضمة. أي لا ولد له المقطوع الذكر والذنب الذليل لا ذكر بخلده. المنسي في الدنيا والآخرة."
      }
    ]
  }
]