[
  {
    "ayah_number": 1,
    "ayah_text": "قُلْ يَا أَيُّهَا الْكَافِرُونَ",
    "parts": [
      {
        "text": "قل",
        "description": "فعل أمر مبني على السكون وحذفت الواو لالتقاء الساكنين والفاعل ضمير مستتر فيه وجوبًا تقديره أنت."
      },
      {
        "text": "يا أيها الكافرون",
        "description": "حرف نداء. أي: منادى مبني على الضم في محل نصب و [ها] زائدة للتنبيه. الكافرون: صفة - نعت - لأي مرفوعة مثلها على اللفظ وعلامة رفعها الواو لأنها جمع مذكر سالم والنون عوض من التنوين والحركة في المفرد."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "لَا أَعْبُدُ مَا تَعْبُدُونَ",
    "parts": [
      {
        "text": "لا أعبد ما",
        "description": "نافية لا عمل لها. أعبد: فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر فيه وجوبًا تقديره أنا. ما: اسم موصول بمعنى (الذي) مبني على السكون في محل نصب مفعول به. والجملة في محل نصب مفعول [قل]."
      },
      {
        "text": "تعبدون",
        "description": "فعل مضارع مرفوع بثبوت النون والواو ضمير متصل في محل رفع فاعل. و الجملة: صلة الموصول لا محل لها من الاعراب. والعائد - الراجع - الى الموصول ضمير محذوف منصوب المحل لأنه مفعول به التقدير تعبدونه. أي لا أعبد يار هط قريش الكفرة الصنم الذي تعبدونه من دون الله."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ",
    "parts": [
      {
        "text": "ولا أنتم",
        "description": "الواو عاطفة. لا: نافية لا عمل لها. أنتم: ضمير رفع منفصل مبني على الضم في محل رفع مبتدأ."
      },
      {
        "text": "عابدون ما أعبد",
        "description": "خبر [أنتم] مرفوع بالواو لأنه جمع مذكر سالم والنون عموض من التنوين والحركة في المفرد. ما أعبد: تعرب اعراب [ما تعبدون] وعلامة رفع الفعل الضمة وفاعله ضمير مستتر فيه وجوبًا تقديره أنا و[ما] ما يعود على الله ويجوز أن تكون [ما] مصدرية فيكون التقدير لا أعبد عبادتكم ولا تعبدون عبادتي."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ",
    "parts": [
      {
        "text": "ولا أنا عابد",
        "description": "أعربت. أنا: ضمير رفع منفصل مبني على السكون في محل رفع مبتدأ. عابد: خبر [أنا] مرفوع بالضمة."
      },
      {
        "text": "ما عبدتم",
        "description": "تعرب اعراب [ما تعبدون] عبدتم: فعل ماضٍ مبني على السكون لاتصاله بضمير الرفع المتحرك. والتاء ضمير متصل - ضمير المخاطبين - مبني على الضم في محل رفع فاعل  والميم علامة جمع الذكور."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ",
    "parts": []
  },
  {
    "ayah_number": 6,
    "ayah_text": "لَكُمْ دِينُكُمْ وَلِيَ دِينِ",
    "parts": [
      {
        "text": "لكم دينكم",
        "description": "جار ومجرور متعلق بخبر مقدم والميم علامة جمع الذكور. دينكم: مبتدأ مؤخر مرفوع بالضمة. والكاف ضمير متصل في محل جر بالاضافة."
      },
      {
        "text": "ولي ديني",
        "description": "معطوفة بالواو على [لكم دينكم] وتعرب اعرابها والباء المحذوفة ضمير متصل في محل جر بالاضافة والكسرة دالة عليها."
      }
    ]
  }
]