[
  {
    "ayah_number": 1,
    "ayah_text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "parts": [
      {
        "text": "الحمد لله",
        "description": "مبتدأ مرفوع بالضمة. اللام حرف جرّ وهي لام التخصيص أي متخصصة با لله سبحانه. الله: لفظ الجلالة: اسم مجرور للتعظيم باللام وعلامة الجرّ: الكسرة الظاهرة. والجارّ والمجرور متعلق بخبر المبتدأ. التقدير: الحمد مختصّ لله. ويطلق على دعاء [الحمد لله]: الحمد لهُ."
      },
      {
        "text": "ربّ العالمين",
        "description": "صفة لله أو بدل منه مجرور مثله بالكسرة الظاهرة. العالمين: مضاف إليه مجرور بالاضافة وعلامة جرّه: الياء لأنه ملحق بجمع المذكر السالم. وفيل: علامة الجرّ: الياء لأنها من جنس الكسرة. والنون عوض عن تنوين المفرد وحركته."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "الرَّحْمَٰنِ الرَّحِيمِ",
    "parts": [
      {
        "text": "الرحمن الرحيم",
        "description": "صفتان ـ نعتان ـ للفظ الجلالة وهما نعتان للمدح. مجروران علامة جرّهما: الكسرة."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "مَالِكِ يَوْمِ الدِّينِ",
    "parts": [
      {
        "text": "مالك يوم الدين",
        "description": "صفة ثالثة للفظ الجلالة مجرور بالكسرة. يوم: مضاف إليه مجرور بالاضافة وعلامة جرّه: الكسرة وهو مضاف. الدين: مضاف إليه مجرور بالاضافة وعلامة جرّه الكسرة وهو من اضافة اسم الفاعل [مالك] الى مفعوله [يوم]."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
    "parts": [
      {
        "text": "إياك نعبد",
        "description": "ضمير منفصل مبني عل السكون في محل نصب مفعول به مقدّم لفعل [نعبد] والكاف حرف جرّ بالاضافة أو حرف خطاب لا محلّ له. نعبد: فعل مضارع مرفوع بالضمة والفاعل ضمي مستتر فيه وجوبًا تقديره: نحن. أو نكون [إيّاك] اسمًا بأكمله في محل نصب بالفعل."
      },
      {
        "text": "وإياك نستعين",
        "description": "الواو: حرف نسق _ عطف. إياك نستعين: معطوفة على [إياك نعبد] وتعرب اعرابها."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
    "parts": [
      {
        "text": "اهدنا",
        "description": "فعل تضرع ودعاء لفظه لفظ الطلب مبني على حذف الياءـ حرف العلةـ والفاعل ضمير مستتر فيه وجوبًا تقديره: أنت. و [نا] ضمير متصل ـ ضمير المتكلمين ـ مبني على السكون في محل نصب مفعول به أول. وقد عدّي الفعل [اهد] هنا بنفسه الى مفعولين."
      },
      {
        "text": "الصراط المستقيم",
        "description": "مفعول به ثانٍ منصوب بالفتحة. المستقيم: صفة ـ نمت ـ للصراط منصوبة مثله بالفتحة."
      }
    ]
  },
  {
    "ayah_number": 6,
    "ayah_text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ",
    "parts": [
      {
        "text": "صراط الذين",
        "description": "بدل من المبدل منه [الصراط] الأولى منصوب بالفتحة. الذين: اسم موصول مبني على الفتح في محل جر بالاضافة."
      },
      {
        "text": "أنعمت عليهم",
        "description": "فعل ماضٍ مبني عل السكون لاتصاله بضمير الرفع المتحرك والتاء: ضمير متصل مبني على  الفتح في محل رفع فاعل وجملة [أنعمت] صلة الموصول لا محل لها من الاعراب على: حرف جرّ وكتبت بالياء لأنّ ألفها المقصورة اتصل بها ضمير فصارت ياءً. ومثلها: عليك.. إليك.. لديك.. وعند مجيئها مع الاسم الظاهر تكتب ألفًا نحو: على زيد.. إلى أحمد.. لدى محمود.. و [هم] ضمير الغائبين مبني على السكون في محل جرّ بعلى والجارّ والمجرور متعلق بأنعمت وكسرت هاء [هم] لمجاورتها الباء."
      }
    ]
  },
  {
    "ayah_number": 7,
    "ayah_text": "غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
    "parts": [
      {
        "text": "غير",
        "description": "صفة _ نعت ـ للموصوف ـ الذين ـ مجرور بالكسرة أو يكون بدلًا من ضمي الغائبين [هم] في [اعليهم] الأولى. وقد وصف الاسم الموصول [الذين] وهو معرفة بالصفة [غير] وهي معرفة أيضًا لأنها أشبهت المعرفة باضافتها الى المعرفة ـ المغضوب ـ فعوملت معاملتها. وقيل: الاضافة هنا ليست للتعريف بل للتخصيص مثل (سوى) و(حسب)  فإنّها تضاف للتخصيص ولا تدخلها(أل) التعريف. وفيل أيضًا: إنّ [غير] اسم مبهم وإنّما أعرب للزوم الاصافة. وقيل: [غير] هنا صفة إلى معرفة قريبة من النكرة لأنّه لم يقصد به ـ أي بالّذين ـ قوم بأعيانهم. و [غير المغضوب] قريبة من المعرفة بالتخصيص الحاصل لها بالاضافة.. فكلّ واحد منهما فيه إبهام من وجه واختصاص من وجه. واذا وقعت [غير] بين متضادّين وكانا معرفتين تعرّفت بالاضافة... نحو: عجبت من الحركة غير السكون. وكذلك الأمر هنا لأنّ المنعم عليه والمغضوب عليه متضادان"
      },
      {
        "text": "المغضوب عليهم",
        "description": "مضاف إليه مجرور بالاضافة وعلامة جرّه: الكسرة. على حرف جرّ و [هم]  ضمير متصل ـ ضمير الغائبين ـ مبني على السكون في محل جرّ بعلى. وشبه الجملة ـ الجارّ والمجرور ـ في محل رفع نائب فاعل لاسم المفعول [المغضوب] أو لفعله بتقدير: غضب عليهم."
      },
      {
        "text": "ولا الضّالّين",
        "description": "الواو: عاطفة. لا: صلة أو تكون زائدة. بتقدير: والضّالين. ويجوز أن تكون تاكيدًا للنّفي أو بمعنى [غير] الضّالّين: معطوف على كلمة [المغضوب عليهم] أو في محل جرّ بالاضافة وعلامة جرّه: الياء لأنّه جمع مذكّر سالم. والنون عوض عن التنوين والحركة في الاسم المفرد."
      }
    ]
  }
]