[
  {
    "ayah_number": 1,
    "ayah_text": "تَبَّتْ يَدَآ أَبِي لَهَبٍ وَتَبَّ",
    "parts": [
      {
        "text": "تبًت يدآ",
        "description": "فعل ماضٍ معناه الاستقبال لأنه دعاء عليه مبني على الفتح والتاء تاء التأنيث الساكنة لا محل لها. يدا: فاعل مرفوع بالألف لأنه مثنى وأصله: يدان وحذفت النون للاضافة أي خسرت يداه وهلكت أو يكون العنى: تب هو أي هلكت نفسه لأن العرب تنسب الأفعال الى اليدين."
      },
      {
        "text": "أبي لهب",
        "description": "مضاف إليه مجرور بالاضافة وعلامة جره الياء لأنه من الأسماء الخمسة. لهب: مضاف اليه مجرور بالكسرة."
      },
      {
        "text": "وتب",
        "description": "الواو عاطفة. تب: فعل ماضٍ لفظًا ومعنى لأنه خبر بمعنى: وكان ذلك وحصل وهو مبني على الفتح و الفاعل ضمير مستتر فيه جوازًا تقديره هو. أي وقد تب: بمعنى وقد هلك."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ",
    "parts": [
      {
        "text": "ما أغنى عنه",
        "description": "نافية لا عمل لها. أو اسم استفهام في معنى الانكار مبني على السكون في محل نصب مفعول به مقدم للفعل [أغنى] أو في محل رفع مبتدأ وخبره جملة [أغنى] بمعنى أي سيء أغنى عنه ماله..  أغنى: فعل ماضٍ مبني على الفتح المقدر على الألف للتعذر. عنه: جار ومجرور متعلق بأغنى وهو في مقام المفعول المقدم بمعنى ما نفعه."
      },
      {
        "text": "ماله وما كسب",
        "description": "فاعل مرفوع بالضمة والهاء ضمير متصل في محل جر بالاضافة الواو عاطفة. ما: اسم موصول مبني على السكون في محل رفع لأنه معطوف على [ماله] كسب: تعرب اعراب [أغنى] وعلامة بنائه الفتحة الظاهرة. وجملة [كسب] صلة الموصول لا محل لها من الاعراب. و العائد ـ الراجع ـ الى الموصول ضمير محذوف منصوب المحل لأنه مفعول به التقدير والذي كسبه أو تكون [ما] مصدرية فتكون [ما] وما بعدها بتأويل مصدر في محل رفع لأنه معطوف على مرفوع. التقدير: مكسوبة أو كسبه."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ",
    "parts": [
      {
        "text": "سيصل نارًا",
        "description": "السين حرف استقبال للتوكيد. يصلى: فعل مضارع مرفوع بالضمة المقدرة على الألف للتعذر و الفاعل ضمير مستتر فيه جوازًا تقديره هو. أي سيدخل. نارًا: مفعول به منصوب وعلامة نصبه الفتحة."
      },
      {
        "text": "ذات لهب",
        "description": "صفة _ نعت ـ لنارٍا منصوبة مثلها بالفتحة. لهب: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ",
    "parts": [
      {
        "text": "وامرأته",
        "description": "معطوفة بالواو على الضمير في [سيصلى] أي سيصلى هو وامرأته مرفوعة بالضمة. والهاء ضمير متصل مبني على الضم في محل جر بالاضافة."
      },
      {
        "text": "حمالة الحطب",
        "description": "حال منصوبة بالفتحة أو مفعول به منصوب على الذم بفعل مضمر تقدره: أذم أو اشتم أو أغني. الحطب: مضاف اليه مجرور بالاضافة وعلامة جر الكسرة."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ",
    "parts": [
      {
        "text": "في جيدها حبل",
        "description": "الجملة الاسمية في محل نصب حال ثانية من [امرأته] فى جيد: جار ومجرور متعلق بخبر مقدم.  و[ها] ضمير متصل مبني على السكون في محل جر بالاضافة. حبل: مبتدأ مؤخر مرفوع بالضمة."
      },
      {
        "text": "من مسد",
        "description": "جار ومجرور متعلق بصفة محذوفة لجبل و [من] حرف جر بياني وقيل لابتداء الغاية بمعنى من ليف."
      }
    ]
  }
]