[
  {
    "ayah_number": 1,
    "ayah_text": "قُلْ هُوَ اللَّهُ أَحَدٌ",
    "parts": [
      {
        "text": "قل",
        "description": "فعل أمر مبني على السكون وحذفت واوه لالتقاء الساكنين والفاعل ضمير مستتر وجوبًا تقدير٥ أنت."
      },
      {
        "text": "هو الله أحد",
        "description": "ضمير رفع منفصل مبني على الفتح في محل رفع مبتدأ. الله لفظ الجلالة: خبره مرفوع للتعظيم بالضمة. أحد: بدل من لفظ الجلالة وان كان نكرة لأن النكرة قد تبدل من المعرف والأصل في [أحد] وحد أي واحد فقلبت الواو ألفًا ويجوز أن يكون (هو) ضمير الشأن في محل رفع مبتدأً وخبره الجملة الاسمية [الله أحد] وهو الشأن على تقدير: الشأن هذا وهو أن الله واحد لا شريك له أي لا ثاني له. و [أحد] بدل من قوله [الله] مرفوع بالضمة أو على (هو أحد) والجملة بعد [قل] في محل نصب مفعول به ـ مقول القول ـ."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "اللَّهُ الصَّمَدُ",
    "parts": [
      {
        "text": "الله الصمد",
        "description": "لفظ الجلالة: مبتدأ مرفوع للتعظيم بالضمة. الصمد: خبره مرفوع بالضمة. وهو فعل بمعنى مفعول من صمد اليه اذا قصده وهو السيد المصمود اليه في الحوائج. أو الباقي بعد فناء خلق ويجوز أن يكون [الصمد] صفة للفظ الجلالة والخبر الاية الكريمة الثالثة أي الجملة الفعلية."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "لَمْ يَلِدْ وَلَمْ يُولَدْ",
    "parts": [
      {
        "text": "لم يلد",
        "description": "حرف نفي وجزم وقلب. يلد: فعل مضارع مجزوم بلم وعلامة جزمه سكون آخره والفاعل فمي مستتر فيه جوازًا تقديره هو. والأصل [يولد] فحذفت الواو لوقوعها بين ماء وكسرة."
      },
      {
        "text": "ولم يولد",
        "description": "الواو عاطفة. لم: أعربت. يولد: فعل مضارع مبني للمجهول مجزوم بلم وعلامة جزمه سكون آخره ونائب الفاعل ضمير مستتر فيه جوازًا تقديره هو. وثبتت الواو لأنها واقعة بين ياء وفتحة والجملة الفعلية: في محل رفع خبر ثانٍ للفظ الجلالة."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
    "parts": [
      {
        "text": "ولم يكن",
        "description": "أعربتا. يكن: فعل مضارع ناقص مجزوم بلم وعلامة جزمه سكون آخره وحذفت الواو لالتقاء الساكنين. سكونها وسكون النون والأصل (يكون) فنقلت الضمة الى الكاف لثقلها على الواو."
      },
      {
        "text": "له كفوًا أحد",
        "description": "جار ومجرور متعلق بالخبر. كفوًا: خبر [يكن] مقدم. أحد: اسم ل[يكن] مرفوع بالضمة وعلامة نصب خبرها [كفوًا] الفتحة المنونة. أي لم يكافئه أحد: أي لم يماثله."
      }
    ]
  }
]