[
  {
    "ayah_number": 1,
    "ayah_text": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ",
    "parts": [
      {
        "text": "قل أعوذ",
        "description": "أعربت في الآية الكريمة السابقة. أعوذ: فعل مضارع مرفوع بالضمة والفاعل ضمير مستتر وجوبًا تقديره أنا."
      },
      {
        "text": "برب الفلق",
        "description": "جار ومجرور متعلق بأعوذ. الفلق: مضاف البه مجرور بالاضافة وعلامة جره الكسرة أي قل التجيء برب الصبح أو الفجر أو برب الخلق كله."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "مِن شَرِّ مَا خَلَقَ",
    "parts": [
      {
        "text": "من شر ما",
        "description": "جار ومجرور متعلق بأعوذ. ما: اسم موصول بمعنى (الذي) مبني على السكون في محل جر بالاضافة."
      },
      {
        "text": "خلق",
        "description": "فعل ماضٍ مبني على الفتح والفاعل ضمير مستتر فيه جوازًا تقديره هو. وجملة [خلق] صلة الموصول لا محل لها من الاعراب والعائد ـ الر راجع ـ الى الموصول ضمير محذوف المحل لأنه مفعول به التقدير: الذي خلقه أو تكون (ما) مصدرية وجملة [خلق] صلتها لامحل لها من الاعراب و [ما] وما بعدها بتأويل مصدر في محل جر بالاضافة التقدير من شر خلفه."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ",
    "parts": [
      {
        "text": "ومن شر غاسق",
        "description": "معطوفة بالواو على [من شر] الأولى. غاسق: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة. أي من نر الليل وقيل: من شر القمر."
      },
      {
        "text": "إذا وقب",
        "description": "ظرف زمان مبني على السكون في محل نصب حال محذوفة من [غاسق] التقدير: كائنًا اذا وقب أي اذا دخل. وقب: فعل ماض مبني على الفتح والفاعل ضمير مستتر فيه جوازًا تقديره هو. وجلة [وقب] في محل جر بالاضافة. أي اذا دخل بظلمته الشديدة على الناس."
      }
    ]
  },
  {
    "ayah_number": 4,
    "ayah_text": "وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ",
    "parts": [
      {
        "text": "تعرب إعراب الآية الكريمة السابقة ـ الثالة ـ في العقد",
        "description": "جار ومجرور متعلق بالنفاثات أي بفعل اسم الفاعل أي من شر النساء أو النفوس أو الجماعات السواحر اللاتي يعقدن عقدًا في خيوط و ينفثن عليها. و [التنفث] النفخ مع ريق."
      }
    ]
  },
  {
    "ayah_number": 5,
    "ayah_text": "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "parts": []
  }
]