[
  {
    "ayah_number": 1,
    "ayah_text": "إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ",
    "parts": [
      {
        "text": "إذا",
        "description": "ظرف لما يستقبل من الزمن مبني على السكون في محل نصب متضمن معنى الشرط خافض لشرطه منصوب بجوابه."
      },
      {
        "text": "جاء نص",
        "description": "الجملة الفعلية: في محل جر بالاضافة. جاء: فعل ماضٍ مبني عى الفتح. نصر: فاعل مرفوع بالضمة."
      },
      {
        "text": "الله والفتح",
        "description": "لفظ الجلالة: مضاف اليه مجرور للتعظيم بالاضافة وعلامة الجر الكسرة. والفتح: معطوفة بالواو على [نصر الله] مرفوعة مثلها بالضمة. أي نصر الله رسوله الكريم ـ ص ـ على أعدائه وفتح له مكة. وحذف مفعول المصدر [نصر] وهو رسوله الكريم اختصارًا لأنه معلوم."
      }
    ]
  },
  {
    "ayah_number": 2,
    "ayah_text": "وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا",
    "parts": [
      {
        "text": "ورأيت الناس",
        "description": "الواو عاطفة. رأى: فعل ماضٍ مبني على السكون لاتصاله بضسمير الرفع المتحرك والتاء ضمير متصل - ضمير المخاطب - مبني على الفتح في محل رفع فاعل. الناس: مفعول به منصوب بالفتحة."
      },
      {
        "text": "يدخلون",
        "description": "فعل مضارع مرفوع بثبوت النون والواو ضمير متصل في محل رفع فاعل. وجملة [يدخلون] في محل نصب حال لأن الفعل [رأى]  بمعنى (أبصر) أو (عرف) وتعدى الفعل الى مفعول واحد. التقدير: داخلين. ويجوز أن تكون الجملة مفعولاً ثانيًا على معنى (علم)"
      },
      {
        "text": "في دين الله أفواجا",
        "description": "جار ومجرور متعلق بيدخلون. الله : مضاف اليه مجرور للتعظيم بالاضافة وعلامة الجر الكسرة أي في ملة الاسلام. أفواجًا: حال منصوب بالفتحة أي يدخلون جماعات كثيفة. مفردها: فوج والفوج: جمع لا مفرد له."
      }
    ]
  },
  {
    "ayah_number": 3,
    "ayah_text": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا",
    "parts": [
      {
        "text": "فسبح",
        "description": "الفاء: واقعة في جواب [اذا] والجملة جواب شرط غير جازم لا محل لها من الاعراب وهي فعل أمر مبني على السكون والفاعل ضمير مستتر فيه وجوبًا تقديره أنت أي فقل سبحان الله وقدسه."
      },
      {
        "text": "بحمد ربك",
        "description": "جار ومجرور متعلق بسبح أو بحال تقديره حامدًا. ربك: مضاف اليه مجرور بالاضافة وعلامة جره الكسرة وهو مضاف والكاف ضمير متصل - ضمير المخاطب - مبني على الفتح في محل جر بالاضافة."
      },
      {
        "text": "واستغفره",
        "description": "معطوفة بالواو على [سبح] وتعرب اعرابها والهاء ضمير متصل مبني على الضم في محل نصب مفعول به."
      },
      {
        "text": "إنه كان توابًا",
        "description": "حرف نصب وتوكيد مشبه بالفعل والهاء ضمير متصل مبني على الضم في محل نصب اسم [ان] والجملة الفعلية بعده: في محل رفع خبرها. كان: فعل ماضٍ ناقص مبني على الفتح واسمها ضمير مستتر جوازًا تقديره هو.  تواباً: خبر [كان] منصوب وعلامة نصبه الفتحة."
      }
    ]
  }
]